Autodesk.Revit.DB.ViewSheet.DeleteViewport(Autodesk.Revit.DB.Viewport)
Removes a viewport from the sheet by deleting it from the document.
viewport:
The viewport that will be deleted and removed from the sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSheet.GetAllPlacedViews
Returns the ElementIds of Views placed on this sheet.
Remarks:
Schedules on the sheet are not returned by this method. Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
Returns:
The ids of the views on this sheet.
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetAllViewports
Returns the ElementIds of Viewports on this sheet.
Remarks:
Schedules on the sheet are not returned by this method. Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
Returns:
The Viewports on this sheet.
Since:
2013

Autodesk.Revit.DB.ViewSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new ViewSheet.
document:
The document to which the ViewSheet will be added.
titleBlockTypeId:
The type id of the TitleBlock type which will be used by the new ViewSheet.
For no TitleBlock, pass invalid element ID.
Returns:
The new ViewSheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId titleBlockTypeId does not correspond to a TitleBlock type.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSheet.CreatePlaceholder(Autodesk.Revit.DB.Document)
Creates a placeholder sheet in a document.
Remarks:
Placeholder sheets represent sheets stored outside of the Revit model,
but which should be organized along with the Revit sheets.
aDoc:
The document.
Returns:
The placeholder sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ViewSheet.SetAdditionalRevisionIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the Revisions to additionally include in the sheet's revision schedules.
Remarks:
Additionally included Revisions will always participate in the sheet's revision schedules.
Normally a Revision is scheduled in the revision schedule because one of its associated RevisionClouds
is present on the sheet.
The additional project revision ids setting corresponds to the sheet's Revisions On Sheet parameter.
projectRevisionIds:
The ids of Revisions to explicitly include in the sheet's revision schedules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more ElementIds in projectRevisionIds do not correspond to a Revision element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetAdditionalRevisionIds
Gets the Revisions that are additionally included in the sheet's revision schedules.
Remarks:
Revisions in the sheet's additional project revision set will appear in revisions schedules
even if no RevisionCloud belonging to that Revision is visible on the sheet.
These ids correspond to the Revisions that are explicitly included on the sheet via the
Revisions On Sheet parameter.
Returns:
The additionally included Revisions for the sheet's revision schedules.
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetAllRevisionIds
Gets the ordered array of Revisions which participate in the sheet's revision schedules.
Remarks:
The Revisions are ordered according to the revision sequence in the project.
A Revision is considered to be participating in revision scheduling on the sheet
if either a revision cloud belonging to that Revision is visible on the sheet or the Revision
has been explicitly included using the Revisions On Sheet parameter.
Returns:
The ordered array of ids of Revisions participating in the sheet's revision schedules.
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetRevisionCloudNumberOnSheet(Autodesk.Revit.DB.ElementId)
Gets the Revision Number for a RevisionCloud on this sheet.
Remarks:
Returns null if the RevisionCloud or its associated Revision do not appear on this sheet. The Revision Number for
a RevisionCloud will always be the same as the Revision Number of the associated Revision.
revisionCloudId:
The id of the RevisionCLoud.
Returns:
Returns the Revision Number as it will appear on this sheet or null if there is no Revision Number assigned on this sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revisionCloudId is not the Id of a RevisionCloud.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetRevisionNumberOnSheet(Autodesk.Revit.DB.ElementId)
Gets the Revision Number for a particular Revision as it will appear on this sheet.
Remarks:
Returns null if the Revision does not appear on this sheet.
revisionId:
The id of the Revision.
Returns:
Returns the Revision Number as it will appear on this sheet or null if the Revision does not appear on this sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
revisionId is not a valid Revision.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewSheet.GetCurrentRevision
Returns the most recent numbered Revision shown on this ViewSheet.
Remarks:
If the most recent Revision is not issued, Revit will typically use it as the default Revision for
RevisionClouds placed on this ViewSheet.  InvalidElementId will be returned if no Revisions are present.
Revisions with RevisionNumberType.None will not be returned.
Returns:
The Id of the most recent numbered Revision shown on this ViewSheet or InvalidElementId if none are shown.
Since:
2015

Autodesk.Revit.DB.ViewSheet.ConvertToRealSheet(Autodesk.Revit.DB.ElementId)
Converts a placeholder sheet to a real one with an optional titleblock.
titleBlockTypeId:
The id of the placeholder sheet, or invalidElementId if no titleblock should be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
titleBlockTypeId does not correspond to a TitleBlock type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method may only be called on a placeholder sheet.
-or-
Failed to convert the sheet because the input titleblock could not be applied.
Since:
2011

Autodesk.Revit.DB.ViewSheet.IsPlaceholder
Identifies whether or not the view sheet represents a placeholder sheet.
Since:
2011

Autodesk.Revit.DB.ViewSheet.SheetNumber
The sheet number of the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: sheetNumber is an empty string or contains only whitespace.
-or-
When setting this property: sheetNumber cannot include prohibited characters.
-or-
When setting this property: Sheet number is already in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.ViewSheet
Class for ViewSheet